driver-tests/bpelse/JavaEEIntegration/JavaEEToBP/FaultTest/webCallGreetSvc/src/java/TestDriver.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/TestDriver"
    xmlns:ns1="#TARGET_NAMESPACE/types"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/TestDriver" name="TestDriver" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:file="http://schemas.sun.com/jbi/wsdl-extensions/file/">

  <!-- Type definitions -->
  <types>
    <xsd:schema targetNamespace="http://sun.com/TestDriver/001/" xmlns:ns1="http://sun.com/TestDriver/001/">
    </xsd:schema>
  </types>
  <!-- Message definitions -->
    <message name="TestDriverOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="TestDriverOperationReply">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="TestDriverPortType">
        <wsdl:operation name="TestDriverOperation">
            <wsdl:input name="input1" message="tns:TestDriverOperationRequest"/>
            <wsdl:output name="output1" message="tns:TestDriverOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="TestDriverBinding" type="tns:TestDriverPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="TestDriverOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/TestDriver"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/TestDriver"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="TestDriverService">
        <wsdl:port name="TestDriverPort" binding="tns:TestDriverBinding">
            <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
        </wsdl:port>
    </service>
</definitions>
