driver-tests/bpelse/JavaEEIntegration/JavaEEToBP/FaultTest/caGreetService/test/GreetCustomer/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tes="http://j2ee.netbeans.org/wsdl/TestDriver">
  <soapenv:Body>
    <tes:TestDriverOperation>
      <part1>Johnny</part1>
    </tes:TestDriverOperation>
  </soapenv:Body>
</soapenv:Envelope>